app/controllers/fixture_pages_controller.rb

  def showPage
    if(params[:id])
      @page = Page.find(params[:id]) #this is temporary
    else
      @page = Page.find_by_name("FrontPage") #FrontPage will the initial entry point
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1) FOR UPDATE
SELECT * FROM `pages` WHERE (`pages`.`name` = 'FrontPage') LIMIT 1

  def updateTable

    table = FixtureSheet.find(params[:id])
    cells = params[:cell]
    #this is a nested hash, how do you loop over a nested hash?
    row = -1
    cells.each_pair do |key,val|
      row = key.to_i if key != "data"
      val.each_pair do |k,v|
       #puts "Cell[#{row}][#{k.to_i}] = #{v[:data]}"
       #puts "\tUPDATING CELL: #{acell.id} ROW: #{acell.row} COL: #{acell.col}"
       table.process_cell(row,k.to_i)do |c|
         c.data = v[:data]
         c.save
       end
      end
    end
    table.toggle(:is_blank)
    table.save
    #look up the page by finding this table's element
    elem = Element.find(:first, :conditions => ["resource_type = :rtype AND resource_id = :rid", {:rtype => "FixtureSheet", :rid => table.id}])
---
SELECT * FROM `fixture_sheets` WHERE (`fixture_sheets`.`id` = 6)
UPDATE `cells` SET `data` = 'some', `col` = 2, `row` = 2, `updated_at` = '2009-01-26 15:34:02' WHERE `id` = 25
UPDATE `fixture_sheets` SET `is_blank` = 0, `updated_at` = '2009-01-26 15:26:13' WHERE `id` = 6
SELECT * FROM `cells` WHERE (`cells`.fixture_sheet_id = 6)
SELECT * FROM `elements` WHERE (resource_type = 'FixtureSheet' AND resource_id = 6) LIMIT 1

  def updateHeading
    h = Heading.find(params[:id])
    h.value = params[:value]
    h.save
---
SELECT * FROM `headings` WHERE (`headings`.`id` = 1)
UPDATE `headings` SET `value` = 'This is a big heading', `updated_at` = '2009-01-26 21:02:20' WHERE `id` = 1

  def updateNote
    #this method will probably serve as a minor controller for parsing wiki text out of the note,
    #then returning the real thing to the server.  If the note contains no wiki widgets, it will just return
    #text, otherwise, I will probably have to generate something on the fly to send back.
    #partials may not work here.
    n = Note.find(params[:id])
    n.data = params[:value]
    n.save
---
SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
UPDATE `notes` SET `data` = 'I have added some real text to this note. Now it is really a real note!', `updated_at` = '2009-01-26 21:50:20' WHERE `id` = 1